adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.svd
              <register>
                <name>ATTR</name>
                <description>Description cluster: The attributes of the local domain firmware master encryption key generation [n]. This field is used as an additional authenticated data (AAD) in AEAD.</description>
                <addressOffset>0x0004</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>TYPE</name>
                    <description>Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1.</description>
                    <lsb>0</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>LEN</name>
                    <description>Length of the key in bits.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CIPHERTEXT[%s]</name>
                <description>Description collection: The encrypted local domain firmware master encryption key generation [n].</description>
                <addressOffset>0x0008</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key value [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x4</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>MAC[%s]</name>
                <description>Description collection: The authentication tag of the local domain firmware master encryption key generation [n].</description>
                <addressOffset>0x0028</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>The word [o] of the authentication tag.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>RFU[%s]</name>
                <description>Description collection:</description>
                <addressOffset>0x0038</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>RFU word [o].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x060</dimIncrement>
              <name>AUTHDEBUGKEY[%s]</name>
              <description>Local domain authenticated debug access public key. The public key is stored as additional authenticated data (AAD) in unencrypted form using an AEAD scheme realized by AES-256 GCM mode,
        with the local domain KEK used as a secret key.
        The initialization vector is provided in NONCE register.
        Key attributes from ATTR register shall be used as an additional authenticated data (AAD) in AEAD.
        The content of PUBKEY registers shall be used as an additional authenticated data (AAD) in AEAD.</description>
              <headerStructName>SICR_AROT_CELLULARCORE_AUTHDEBUGKEY</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0080</addressOffset>
              <register>
                <name>NONCE</name>
                <description>Description cluster: The initialization vector of the encryption algorithm used to protect the local domain authenticated debug access public key generation [n].</description>
                <addressOffset>0x0000</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value of nonce used by AEAD.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>ATTR</name>
                <description>Description cluster: The attributes of the local domain firmware master encryption key generation [n]. This field is used as an additional authenticated data (AAD) in AEAD.</description>
                <addressOffset>0x0004</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>TYPE</name>
                    <description>Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1.</description>
                    <lsb>0</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>LEN</name>
                    <description>Length of the key in bits.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>PUBKEY[%s]</name>
                <description>Description collection: The local domain authenticated debug access public key generation [n].</description>
                <addressOffset>0x0008</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key value [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x4</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>MAC[%s]</name>
                <description>Description collection: The authentication tag of the local domain authenticated debug access public key generation [n].</description>
                <addressOffset>0x0048</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>The word [o] of the authentication tag.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>RFU[%s]</name>
                <description>Description collection:</description>
                <addressOffset>0x0058</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>RFU word [o].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x060</dimIncrement>
              <name>SUITPUBKEY[%s]</name>
              <description>Public key used by the local domain SUIT manifest. The public key is stored as additional authenticated data (AAD) in unencrypted form using an AEAD scheme realized by AES-256 GCM mode,
        with the local domain KEK used as a secret key.
        The initialization vector is provided in NONCE register.
        Key attributes from ATTR register shall be used as an additional authenticated data (AAD) in AEAD.
        The content of PUBKEY registers shall be used as an additional authenticated data (AAD) in AEAD.</description>
              <headerStructName>SICR_AROT_CELLULARCORE_SUITPUBKEY</headerStructName>
              <access>read-write</access>
              <addressOffset>0x01A0</addressOffset>
              <register>
                <name>NONCE</name>
                <description>Description cluster: The initialization vector of the encryption algorithm used to protect the local domain SUIT manifest public key generation [n].</description>
                <addressOffset>0x0000</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value of nonce used by AEAD.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>ATTR</name>
                <description>Description cluster: The attributes of the local domain firmware master encryption key generation [n]. This field is used as an additional authenticated data (AAD) in AEAD.</description>
                <addressOffset>0x0004</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>TYPE</name>
                    <description>Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1.</description>
                    <lsb>0</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>LEN</name>
                    <description>Length of the key in bits.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>PUBKEY[%s]</name>
                <description>Description collection: The local domain SUIT manifest public key generation [n].</description>
                <addressOffset>0x0008</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key value [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x4</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>MAC[%s]</name>
                <description>Description collection: The authentication tag of the local domain SUIT manifest public key generation [n].</description>
                <addressOffset>0x0048</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>The word [o] of the authentication tag.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>RFU[%s]</name>
                <description>Description collection:</description>
                <addressOffset>0x0058</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>RFU word [o].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>DATAPROTECTION</name>
              <description>Elements used for validation of data provisioned onto a device by the local domain.</description>
              <headerStructName>SICR_AROT_CELLULARCORE_DATAPROTECTION</headerStructName>
              <access>read-write</access>
              <addressOffset>0x02C0</addressOffset>
              <cluster>
                <name>UICR</name>
                <description>Authentication tag used for validation of the content of the UICRs. The UICRs content provides information about a domain peripherals associations and memory layout configuration.
        It is stored in an unencrypted form in a dedicated memory location.
        A validation shall be performed using an AEAD scheme realized by AES-256 GCM mode,
        with the domain KEK used as a secret key and UICR content used as additional authenticated data (AAD).
        The initialization vector is provided in NONCE register.</description>
                <headerStructName>SICR_AROT_CELLULARCORE_DATAPROTECTION_UICR</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0000</addressOffset>
                <register>
                  <name>NONCE</name>
                  <description>The initialization vector of the encryption algorithm used to protect the domain UICRs content.</description>
                  <addressOffset>0x0000</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Value of nonce used by AEAD.</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>MAC[%s]</name>
                  <description>Description collection: The authentication tag of the domain UICRs.</description>
                  <addressOffset>0x0004</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>The word [n] of the authentication tag.</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x3</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>RFU[%s]</name>
                  <description>Description collection:</description>
                  <addressOffset>0x0014</addressOffset>
                  <access>read-write</access>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>RFU word [n].</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>DOMAINSTATE</name>
              <description>Registers holding the information regarding the local domain state.</description>
              <headerStructName>SICR_AROT_CELLULARCORE_DOMAINSTATE</headerStructName>
              <access>read-write</access>
              <addressOffset>0x02E0</addressOffset>
              <register>
                <dim>0x3</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>RFU[%s]</name>
                <description>Description collection:</description>
                <addressOffset>0x0000</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>RFU word [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>LCS</name>
                <description>The local domain lifecycle state as determined by the URoT.</description>
                <addressOffset>0x000C</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATE</name>
                    <description>The local domain lifecycle state.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>AssemblyAndTest</name>
                        <description>The local domain assets are installed in this state. This includes the optional local domain ARoT (its secure program).</description>
                        <value>0x3590FCC5</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>ARoTProvisioning</name>
                        <description>The optional local domain ARoT is provisioned in this state.</description>
                        <value>0xF6852179</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secured</name>
                        <description>The local domain assets are provisioned and secured.</description>
                        <value>0x9F6B5F01</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>WIFICORE</name>
            <description>Unspecified</description>
            <headerStructName>SICR_AROT_WIFICORE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x1000</addressOffset>
            <cluster>
              <dim>2</dim>
              <dimIncrement>0x040</dimIncrement>
              <name>FWENC[%s]</name>
              <description>Local domain firmware master encryption key. The key is stored in an encrypted then authenticated form using an AEAD scheme realized by AES-256 GCM mode,
        with the local domain KEK used as a secret key.
        The initialization vector is provided in NONCE register.
        Key attributes from ATTR register shall be used as an additional authenticated data (AAD) in AEAD.</description>
              <headerStructName>SICR_AROT_WIFICORE_FWENC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0000</addressOffset>
              <register>
                <name>NONCE</name>
                <description>Description cluster: The initialization vector of the encryption algorithm used to protect the local domain firmware master encryption key generation [n].</description>
                <addressOffset>0x0000</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value of nonce used by AEAD.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>ATTR</name>
                <description>Description cluster: The attributes of the local domain firmware master encryption key generation [n]. This field is used as an additional authenticated data (AAD) in AEAD.</description>
                <addressOffset>0x0004</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>TYPE</name>
                    <description>Type of the key. This field should follow the key type encoding from PSA Crypto API v1.2.1.</description>
                    <lsb>0</lsb>
                    <msb>15</msb>
                  </field>
                  <field>
                    <name>LEN</name>
                    <description>Length of the key in bits.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CIPHERTEXT[%s]</name>
                <description>Description collection: The encrypted local domain firmware master encryption key generation [n].</description>
                <addressOffset>0x0008</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key value [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x4</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>MAC[%s]</name>
                <description>Description collection: The authentication tag of the local domain firmware master encryption key generation [n].</description>
                <addressOffset>0x0028</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>The word [o] of the authentication tag.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>RFU[%s]</name>
                <description>Description collection:</description>
                <addressOffset>0x0038</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>RFU word [o].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
