adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RICR_S</name>
      <description>ROM Information Configuration Registers</description>
      <baseAddress>0x0FFFC000</baseAddress>
      <headerStructName>RICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>RICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>LCS</name>
          <description>Unspecified</description>
          <headerStructName>RICR_LCS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0000</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>SIGNATURE[%s]</name>
            <description>Description collection: Signature to determine the re-entrant device life-cycle state (LCS).</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Uninitialized when freshly out of factory, esle PUF-derived LCS signature.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>UNINITIALIZED</name>
                    <description>Value of LCS registers when the device is freshly manufactured
           (LCS state FFF), and  the MRAM and the info pages including RICR
           are uninitialized.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>UROT</name>
          <description>Unspecified</description>
          <headerStructName>RICR_UROT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0010</addressOffset>
          <cluster>
            <name>SMWD</name>
            <description>Signed Manifest verified by the secure domain ROM Code to establish the
        primary RoT with digest.</description>
            <headerStructName>RICR_UROT_SMWD</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0000</addressOffset>
            <cluster>
              <name>SM</name>
              <description>Signed Manifest verified by the Secure Domain ROM Code to establish the primary RoT.</description>
              <headerStructName>RICR_UROT_SMWD_SM</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0000</addressOffset>
              <cluster>
                <name>TBS</name>
                <description>Manifest describing the secure domain firmware.
          The secure domain ROM code verifies the signature on the digest of this register.</description>
                <headerStructName>RICR_UROT_SMWD_SM_TBS</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0000</addressOffset>
                <cluster>
                  <name>PUBKEY</name>
                  <description>Raw public key used to verify the signed manifest.</description>
                  <headerStructName>RICR_UROT_SMWD_SM_TBS_PUBKEY</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0000</addressOffset>
                  <register>
                    <name>SIZE</name>
                    <description>The size of the raw public key(in bytes).</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>SIZE</name>
                        <description>Key size</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The key is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>SizeEd25519</name>
                            <description>The size of the raw Ed25519 public key.
                  Currently this is the only size supported by the secure domain ROM code.</description>
                            <value>0x00000020</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>ADDR</name>
                    <description>Address of the raw public key.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <description>Public key address.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The key is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <cluster>
                  <name>LAYOUT</name>
                  <description>The MRAM layout of UROT firmware and the recovery image.</description>
                  <headerStructName>RICR_UROT_SMWD_SM_TBS_LAYOUT</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0008</addressOffset>
                  <cluster>
                    <name>USLOT</name>
                    <description>Start adddress and max size of UROT slot (USLOT), Shall remain the same for firmware
               updates once programmed or unless transitioned back to LCS Empty.</description>
                    <headerStructName>RICR_UROT_SMWD_SM_TBS_LAYOUT_USLOT</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0000</addressOffset>
                    <register>
                      <name>START</name>
                      <description>Start address of the UROT firmware. Shall not overlap with the recovery slot (RSLOT).</description>
                      <addressOffset>0x0000</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ADDR</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Undefined</name>
                              <description>The slot is not defined.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>MAX</name>
                      <description>Maximum size of the UROT firmware in bytes.</description>
                      <addressOffset>0x0004</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>SIZE</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Undefined</name>
                              <description>The slot is not defined.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                  <cluster>
                    <name>RSLOT</name>
                    <description>Start adddress and max size of recovery slot (RSLOT), Shall remain the same for
                firmware updates once programmed or unless transitioned back to LCS Empty.</description>
                    <headerStructName>RICR_UROT_SMWD_SM_TBS_LAYOUT_RSLOT</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0008</addressOffset>
                    <register>
                      <name>START</name>
                      <description>Start address of the recovery firmware. Shall not overlap with the UROT slot(USLOT).</description>
                      <addressOffset>0x0000</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ADDR</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Undefined</name>
                              <description>The slot is not defined.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>MAX</name>
                      <description>Maximum size of the recovery image in bytes.</description>
                      <addressOffset>0x0004</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>SIZE</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Undefined</name>
                              <description>The slot is not defined.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                </cluster>
                <cluster>
                  <name>FW</name>
                  <description>FW verified by the secure domain ROM code.</description>
                  <headerStructName>RICR_UROT_SMWD_SM_TBS_FW</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0018</addressOffset>
                  <register>
                    <name>SIZE</name>
                    <description>The firmware size (in bytes). Shall not exceed the max defined
              limits for USLOT in case of UROT firmware.Shall not exceed the max
              defined limits for USLOT in case of UROT firmware.</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>SIZE</name>
                        <description>Firmware size</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>ADDR</name>
                    <description>Address of the firmware verified by the secure domain
              ROM code.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <description>Firmware address</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>DIGEST[%s]</name>
                    <description>Description collection: SHA2-512 digest of the firmware.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>SHA2-512 Digest value</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW digest, and hence the FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>VERSION[%s]</name>
                    <description>Description collection: 128-bit revision of the firmware; can be left Unprogrammed.</description>
                    <addressOffset>0x0048</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>nth word of the version.</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>TIMESTAMP</name>
                    <description>Unsigned 32-bit integer timestamp of the firmware in Unix time used to prevent
               downgrade of firmware on firmware update.</description>
                    <addressOffset>0x0058</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>Unsigned unix-time timestamp of the firmware</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The FW timestamp is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>PARTNO</name>
                    <description>Part-number for which the firmware is built. Must match
               the part number in OICR region.</description>
                    <addressOffset>0x005C</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>Part number of the device for which the firmware is built.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The part number is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <cluster>
                  <name>POLICY</name>
                  <description>Set various policies on related to the firmware verification and
            update.</description>
                  <headerStructName>RICR_UROT_SMWD_SM_TBS_POLICY</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x0078</addressOffset>
                  <register>
                    <name>UPDATE</name>
                    <description>Enable or Disable firmware update.</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                  on update is left unchanged.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable firmware update.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable firmware update.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>REVOKE</name>
                    <description>Configure key revocation policy.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                   on auto-revocation is left unchanged.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable auto-revocation of keys.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable auto-revocation of keys used to verify firmware.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>DGPREV</name>
                    <description>Configure the downgrade prevention policy.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ENABLE</name>
                        <description>Possible values for this register</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The policy is not programmed, hence any existing policy
                  on downgrade prevention is unaltered.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Enabled</name>
                            <description>Enable downgrade protection on firmware update.
                  If Enabled, the SM.TBS.FW.TIMESTAMP register cannot be left
                  Unprogrammed.</description>
                            <value>0xC3965A5A</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>Disabled</name>
                            <description>Disable downgrade protection on firmware updates.
                  If Disabled, the SM.TBS.FW.TIMESTAMP register shall be left
                  Unprogrammed.</description>
                            <value>0x47D13CA5</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
