adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.svd
                    <register>
                      <dim>0x10</dim>
                      <dimIncrement>0x4</dimIncrement>
                      <name>DIGEST[%s]</name>
                      <description>Description collection: SHA2-512 digest of the firmware.</description>
                      <addressOffset>0x0008</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>VALUE</name>
                          <description>SHA2-512 Digest value</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The FW digest, and hence the FW is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <dim>0x4</dim>
                      <dimIncrement>0x4</dimIncrement>
                      <name>VERSION[%s]</name>
                      <description>Description collection: 128-bit revision of the firmware; can be left Unprogrammed.</description>
                      <addressOffset>0x0048</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>VALUE</name>
                          <description>nth word of the version.</description>
                          <lsb>0</lsb>
                          <msb>0</msb>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>TIMESTAMP</name>
                      <description>Unsigned 32-bit integer timestamp of the firmware in Unix time used to prevent
               downgrade of firmware on firmware update.</description>
                      <addressOffset>0x0058</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>VALUE</name>
                          <description>Unsigned unix-time timestamp of the firmware</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The FW timestamp is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>PARTNO</name>
                      <description>Part-number for which the firmware is built. Must match
               the part number in OICR region.</description>
                      <addressOffset>0x005C</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>VALUE</name>
                          <description>Part number of the device for which the firmware is built.</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The part number is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                  <cluster>
                    <name>POLICY</name>
                    <description>Set various policies on related to the firmware verification and
            update.</description>
                    <headerStructName>RICR_UROT_RECOVERY_SMWD_SM_TBS_POLICY</headerStructName>
                    <access>read-write</access>
                    <addressOffset>0x0078</addressOffset>
                    <register>
                      <name>UPDATE</name>
                      <description>Enable or Disable firmware update.</description>
                      <addressOffset>0x0000</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ENABLE</name>
                          <description>Possible values for this register.</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The policy is not programmed, hence any existing policy
                  on update is left unchanged.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Enabled</name>
                              <description>Enable firmware update.</description>
                              <value>0xC3965A5A</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Disabled</name>
                              <description>Disable firmware update.</description>
                              <value>0x47D13CA5</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>REVOKE</name>
                      <description>Configure key revocation policy.</description>
                      <addressOffset>0x0004</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ENABLE</name>
                          <description>Possible values for this register</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The policy is not programmed, hence any existing policy
                   on auto-revocation is left unchanged.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Enabled</name>
                              <description>Enable auto-revocation of keys.</description>
                              <value>0xC3965A5A</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Disabled</name>
                              <description>Disable auto-revocation of keys used to verify firmware.</description>
                              <value>0x47D13CA5</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <name>DGPREV</name>
                      <description>Configure the downgrade prevention policy.</description>
                      <addressOffset>0x0008</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>ENABLE</name>
                          <description>Possible values for this register</description>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The policy is not programmed, hence any existing policy
                  on downgrade prevention is unaltered.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Enabled</name>
                              <description>Enable downgrade protection on firmware update.
                  If Enabled, the SM.TBS.FW.TIMESTAMP register cannot be left
                  Unprogrammed.</description>
                              <value>0xC3965A5A</value>
                            </enumeratedValue>
                            <enumeratedValue>
                              <name>Disabled</name>
                              <description>Disable downgrade protection on firmware updates.
                  If Disabled, the SM.TBS.FW.TIMESTAMP register shall be left
                  Unprogrammed.</description>
                              <value>0x47D13CA5</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                    <register>
                      <dim>0x5</dim>
                      <dimIncrement>0x4</dimIncrement>
                      <name>RFU[%s]</name>
                      <description>Description collection: These registers are included when generating signature of the TBS content of SM.</description>
                      <addressOffset>0x000C</addressOffset>
                      <access>read-write</access>
                      <size>0x20</size>
                      <fields>
                        <field>
                          <name>RFU</name>
                          <lsb>0</lsb>
                          <msb>31</msb>
                          <enumeratedValues>
                            <enumeratedValue>
                              <name>Unprogrammed</name>
                              <description>The register is not programmed.</description>
                              <value>0xFFFFFFFF</value>
                            </enumeratedValue>
                          </enumeratedValues>
                        </field>
                      </fields>
                    </register>
                  </cluster>
                  <register>
                    <dim>0x10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>CIPHERDIGEST[%s]</name>
                    <description>Description collection: SHA2-512 digest of the AES-GCM AAD, IV and encrypted firmware.</description>
                    <addressOffset>0x0098</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>SHA2-512 Digest value</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>Encrypted firmware digest, unprogrammed if the FW is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <dim>0x4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>RFU[%s]</name>
                    <description>Description collection: These registers are included when generating signature of the TBS content of SM</description>
                    <addressOffset>0x00D8</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>RFU</name>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The register is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
                <cluster>
                  <name>SIGNATURE</name>
                  <description>Signature on the manifest defined in TBS</description>
                  <headerStructName>RICR_UROT_RECOVERY_SMWD_SM_SIGNATURE</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x00F4</addressOffset>
                  <register>
                    <name>ALG</name>
                    <description>The signature algorithm identifier as defined in RFC8152.</description>
                    <addressOffset>0x0000</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ID</name>
                        <description>Algorithm identifier</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The signature algorithm identifier is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>AlgIdEd25519</name>
                            <description>ARM ADAC-defined identifier for Ed25519.
                   The use of ARM ADAC-defined identifier ensures consistent
                   user interface on CTRL-AP and SICR.
                   Only Ed25519 curve is supported.</description>
                            <value>0x00000005</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>SIZE</name>
                    <description>Size of the raw signature in bytes.</description>
                    <addressOffset>0x0004</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>SIZE</name>
                        <description>Signature size</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The signature is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>SizeEd25519</name>
                            <description>Size of Ed25519 signature bytestring.</description>
                            <value>0x00000040</value>
                          </enumeratedValue>
                          <enumeratedValue>
                            <name>MaxSize</name>
                            <description>Currently, the secure domain ROM code supports only Ed25519 (and only Ed25519 curve) signature scheme,
                   and hence the MaxSize is the same as the Ed25519 signature
                   size.</description>
                            <value>0x00000040</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                  <register>
                    <name>ADDR</name>
                    <description>Address of the signature on the firmware manifest.</description>
                    <addressOffset>0x0008</addressOffset>
                    <access>read-write</access>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>ADDR</name>
                        <description>Signature address.</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                        <enumeratedValues>
                          <enumeratedValue>
                            <name>Unprogrammed</name>
                            <description>The signature is not programmed.</description>
                            <value>0xFFFFFFFF</value>
                          </enumeratedValue>
                        </enumeratedValues>
                      </field>
                    </fields>
                  </register>
                </cluster>
              </cluster>
              <register>
                <dim>0x10</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: SHA-512 Digest of the signed manifest used for intregrity check of the
          signed-manifest. Utilized in scenarios involving warm-boot and
          firmware update.</description>
                <addressOffset>0x0100</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>UPWD</name>
            <description>Update with digest. Digest is used to ensure SICR contents where not
        tampered when resuming any paused processing of the update.</description>
            <headerStructName>RICR_UROT_UPWD</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0340</addressOffset>
            <cluster>
              <name>UPDATE</name>
              <description>Description of FW Updates, if any.
        In case, SICR.UROT.TBS.POLICY.UPDATE is set to Disabled,
        these registers are ignored by the secure domain ROM code.</description>
              <headerStructName>RICR_UROT_UPWD_UPDATE</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0000</addressOffset>
              <register>
                <name>OPERATION</name>
                <description>Command from the secure domain firmware to the secure domain ROM code.</description>
                <addressOffset>0x0000</addressOffset>
                <access>read-write</access>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>OPCODE</name>
                    <description>Opcode to identify the command.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Nop</name>
                        <description>No operation pending.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>UROTVerify</name>
                        <description>Command to only verify UROT (plain-text or encrypted) firmware
                update without applying it.</description>
                        <value>0x80000001</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>UROTActivate</name>
                        <description>Command to verify and update encrypted UROT firmware.</description>
                        <value>0x80000002</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>RecoveryVerify</name>
                        <description>Command to verify the recovery (plain-text only) firmware update
                without applying it.</description>
                        <value>0x80000003</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>RecoveryActivate</name>
                        <description>Command to verify and update plain-text Recovery firmware.</description>
                        <value>0x80000004</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>UROTPlainTextActivate</name>
                        <description>Command to verify and update plain-text UROT firmware.</description>
                        <value>0x80000005</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>AROTRecovery</name>
                        <description>Instructs the ROM code to boot the recovery image in safe mode
                to download a AROT image instead of a UROT image.</description>
                        <value>0xA0000001</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
