adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.svd
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x1000</dimIncrement>
          <name>DWCOTGDFIFO[%s]</name>
          <description>Unspecified</description>
          <headerStructName>USBHSCORE_DWCOTGDFIFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1000</addressOffset>
          <register>
            <dim>0x400</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Data FIFO Access Register Map 0</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
          </register>
        </cluster>
        <cluster>
          <name>DWCOTGDFIFODIRECTACCESS</name>
          <description>Unspecified</description>
          <headerStructName>USBHSCORE_DWCOTGDFIFODIRECTACCESS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x20000</addressOffset>
          <register>
            <dim>0x8000</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Data FIFO Direct Access Register Map</description>
            <addressOffset>0x00000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_USBHSCORE0_NS">
      <name>GLOBAL_USBHSCORE0_S</name>
      <description>USBHSCORE 1</description>
      <baseAddress>0x2F700000</baseAddress>
      <alternatePeripheral>GLOBAL_USBHSCORE0_NS</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_I3CCORE120_NS</name>
      <description>I3CCORE 0</description>
      <baseAddress>0x2FBE0000</baseAddress>
      <headerStructName>I3CCORE</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>I3CCORE</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>CORE</name>
          <description>Unspecified</description>
          <headerStructName>I3CCORE_CORE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>DEVICECTRL</name>
            <description>DWC_mipi_i3c control Register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IBAINCLUDE</name>
                <description>I3C Broadcast Address include</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_INCLUDED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INCLUDED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2CSLAVEPRESENT</name>
                <description>I2C Slave Present</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HOTJOINCTRL</name>
                <description>Hot-Join ACK/NACK Control</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IDLECNTMULTPLIER</name>
                <description>Idle Count Multiplier</description>
                <lsb>24</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MultiplyBy1</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MultiplyBy2</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MultiplyBy4</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MultiplyBy8</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ADAPTIVEI2CI3C</name>
                <description>This field is used in Slave mode of operation.</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>DMAENABLE</name>
                <description>DMA Handshake Interface Enable</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>The DMA handshake control has no significance.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enables the DMA handshake control to interact with external DMA.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ABORT</name>
                <description>DWC_mipi_i3c Abort</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>RESUME</name>
                <description>DWC_mipi_i3c Resume</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Controls whether or not DWC_mipi_i3c is enabled.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Disables the DWC_mipi_i3c controller</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Enables the DWC_mipi_i3c controller.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICEADDR</name>
            <description>In the master mode of operation this Register is used to program the Device Dynamic Addresses and its respective valid bit.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x80000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATICADDR</name>
                <description>Device Static Address.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>STATICADDRVALID</name>
                <description>Static Address Valid.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INVALID</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALID</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DYNAMICADDR</name>
                <description>Device Dynamic Address.</description>
                <lsb>16</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>DYNAMICADDRVALID</name>
                <description>Dynamic Address Valid</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INVALID</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VALID</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>HWCAPABILITY</name>
            <description>Hardware Capability register</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x000E187B</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DEVICEROLECONFIG</name>
                <description>Reflects the IC_DEVICE_ROLE Configurable Parameter.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASTER</name>
                    <description>Master Only</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PMASTERSLAVE</name>
                    <description>Programmable Master-Slave</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECONDARYMASTER</name>
                    <description>Secondary Master</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVE</name>
                    <description>Slave Only</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HDRDDREN</name>
                <description>Reflects the IC_SPEED_HDR_DDR Configurable Parameter.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOTSUPPORTED</name>
                    <description>HDR-DDR not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUPPORTED</name>
                    <description>HDR-DDR supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HDRTSEN</name>
                <description>Reflects the IC_SPEED_HDR_TS Configurable Parameter.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOTSUPPORTED</name>
                    <description>HDR-TS not supported</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUPPORTED</name>
                    <description>HDR-TS supported</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLOCKPERIOD</name>
                <description>Reflects the IC_CLK_PERIOD Configurable Parameter</description>
                <lsb>5</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>HDRTXCLOCKPERIOD</name>
                <description>Reflects the IC_HDR_TX_CLK_PERIOD Configurable Parameter.</description>
                <lsb>11</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DMAEN</name>
                <description>Reflects the IC_HAS_DMA Configurable Parameter.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SLVHJCAP</name>
                <description>Reflects the IC_SLV_HJ Configurable Parameter.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SLVIBICAP</name>
                <description>Reflects the IC_SLV_IBI Configurable Parameter.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COMMANDQUEUEPORT</name>
            <description>Command Queue Port.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COMMAND</name>
                <description>32 bit command</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESPONSEQUEUEPORT</name>
            <description>Response Queue Port</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESPONSE</name>
                <description>32 bit Response</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RXDATAPORT</name>
            <description>Receive Data Port Register</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXDATAPORT</name>
                <description>Receive Data Port.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXDATAPORT</name>
            <description>Transmit Data Port Register</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <alternateRegister>RXDATAPORT</alternateRegister>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXDATAPORT</name>
                <description>Transmit Data Port</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IBIQUEUEDATA</name>
            <description>In-Band Interrupt Queue Data Register</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IBIDATA</name>
                <description>In-Band Interrupt Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IBIQUEUESTATUS</name>
            <description>In-Band Interrupt Queue Status Register</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <alternateRegister>IBIQUEUEDATA</alternateRegister>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATALENGTH</name>
                <description>In-Band Interrupt data length.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IBIID</name>
                <description>IBI Identifier.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>IBIACK</name>
                <description>The acknowledge bit of the IBI Received Status (IBISTS) bitfield.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ACK</name>
                    <description>Responded with ACK</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NACK</name>
                    <description>Responded with NACK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>QUEUETHLDCTRL</name>
            <description>Queue Threshold Control Register</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x01000101</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDEMPTYBUFTHLD</name>
                <description>Command Buffer Empty Threshold Value.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>RESPBUFTHLD</name>
                <description>Response Buffer Threshold Value.</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>IBISTATUSTHLD</name>
                <description>In-Band Interrupt Status Threshold Value.</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
