adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CRACENCORE_NS">
      <name>CRACENCORE_S</name>
      <description>CRACENCORE 1</description>
      <baseAddress>0x51800000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_STMDATA_NS</name>
      <description>System Trace Macrocell data buffer 0</description>
      <baseAddress>0xA0000000</baseAddress>
      <headerStructName>STMDATA</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x10000000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>STMDATA</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x1000000</dimIncrement>
          <name>DOMAIN[%s]</name>
          <description>Unspecified</description>
          <headerStructName>STMDATA_DOMAIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <dim>0x1000000</dim>
            <dimIncrement>0x1</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: STM extended stimulus port data buffer area for domain n. NonSecure writes to this region generates trace packets with id n+96. Secure writes to this region generates trace packets with id n+32.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <dataType>uint8_t</dataType>
            <size>0x8</size>
            <!--Security securemapping=NS-->
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_STMDATA_NS">
      <name>GLOBAL_STMDATA_S</name>
      <description>System Trace Macrocell data buffer 1</description>
      <baseAddress>0xA0000000</baseAddress>
      <alternatePeripheral>GLOBAL_STMDATA_NS</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <!--Split access-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_TDDCONF_NS</name>
      <description>TDDCONF 0</description>
      <baseAddress>0xBF001000</baseAddress>
      <headerStructName>TDDCONF</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>TDDCONF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>SYSPWRUPREQ</name>
          <description>System power-up request</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Activate power-up request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Power-up request not active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power-up request active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGPWRUPREQ</name>
          <description>Debug power-up request</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Activate power-up request</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Power-up request not active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Power-up request active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACEPORTSPEED</name>
          <description>Trace port trace clock speed</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPEED</name>
              <description>Trace clock speed</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Speed80MHz</name>
                  <description>Speed 80MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Speed40MHz</name>
                  <description>Speed 40MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Speed20MHz</name>
                  <description>Speed 20MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Speed10MHz</name>
                  <description>Speed 10MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGPOWERREQSTATUS</name>
          <description>Combined effective system status of both SWJ-DP and TDDCONF registers originated power requests</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SYSPWRUPREQUESTED</name>
              <description>System powerup request status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoPowerReq</name>
                  <description>Power not requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PowerReq</name>
                  <description>Power requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGPWRUPREQUESTED</name>
              <description>Debug domain powerup request status</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoPowerReq</name>
                  <description>Power not requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PowerReq</name>
                  <description>Power requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
