adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.svd
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>INTERRUPT[%s]</name>
                <description>Description collection: Configuration of features for interrupt n of IPCT</description>
                <addressOffset>0x060</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>DPPIC</name>
              <description>Unspecified</description>
              <headerStructName>FEATURE_STRUCT0_DPPIC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x080</addressOffset>
              <register>
                <dim>0x18</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CH[%s]</name>
                <description>Description collection: Configuration of features for channel n of DPPIC</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CHG[%s]</name>
                <description>Description collection: Configuration of features for channel group n of DPPIC</description>
                <addressOffset>0x060</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>1</dim>
              <dimIncrement>0x040</dimIncrement>
              <name>GPIOTE[%s]</name>
              <description>Unspecified</description>
              <headerStructName>FEATURE_STRUCT0_GPIOTE</headerStructName>
              <access>read-write</access>
              <addressOffset>0x100</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CH[%s]</name>
                <description>Description collection: Configuration of features for channel o of GPIOTE[n]</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>INTERRUPT[%s]</name>
                <description>Description collection: Configuration of features for interrupt o of GPIOTE[n]</description>
                <addressOffset>0x020</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>10</dim>
              <dimIncrement>0x080</dimIncrement>
              <name>GPIO[%s]</name>
              <description>Unspecified</description>
              <headerStructName>GPIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x200</addressOffset>
              <register>
                <dim>0x20</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>PIN[%s]</name>
                <description>Description collection: Configuration of features for GPIO[n] PIN[o]</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>SECATTR</name>
                    <description>SECATTR feature</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>Feature is available for non-secure usage</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>Feature is reserved for secure usage</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>LOCK feature</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Unlocked</name>
                        <description>Feature permissions can be updated</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Locked</name>
                        <description>Feature permissions can not be changed until the next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>BLOCK</name>
                    <description>BLOCK feature</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Available</name>
                        <description>Feature is accessible</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Blocked</name>
                        <description>Feature cannot be accessed until next reset</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>OWNERID</name>
                    <description>Feature owner ID</description>
                    <lsb>16</lsb>
                    <msb>19</msb>
                  </field>
                </fields>
              </register>
            </cluster>
