adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="LRCCONF000_NS">
      <name>LRCCONF000_S</name>
      <description>LRCCONF 1</description>
      <baseAddress>0x5100E000</baseAddress>
      <alternatePeripheral>LRCCONF000_NS</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="PCGCM000_S">
      <name>PCGCM001_NS</name>
      <description>PCGC Master 1</description>
      <baseAddress>0x5100F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="PCGCM000_S">
      <name>PCGCM001_S</name>
      <description>PCGC Master 2</description>
      <baseAddress>0x5100F000</baseAddress>
      <alternatePeripheral>PCGCM001_NS</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral derivedFrom="SPU000_S">
      <name>SPU010_S</name>
      <description>System protection unit 1</description>
      <baseAddress>0x51010000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <interrupt>
        <name>SPU010</name>
        <value>16</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CPUCONF_NS</name>
      <description>CPU Configuration 0</description>
      <baseAddress>0x41011000</baseAddress>
      <headerStructName>CPUCONF</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>CPUCONF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_ERASECACHE</name>
          <description>Erase the caches used by the CPU.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_ERASECACHE</name>
              <description>Erase the caches used by the CPU.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INITSVTOR</name>
          <description>Initial value of the secure VTOR (Vector Table Offset Register) after CPU reset.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INITSVTOR</name>
              <description>Initial value of the VTOR.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INITNSVTOR</name>
          <description>Initial value of the non-secure VTOR (Vector Table Offset Register).</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INITNSVTOR</name>
              <description>Initial value of the VTOR.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUSTART</name>
          <description>Enable for starting the CPU</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable to start the CPU.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stopped</name>
                  <description>CPU stopped.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Started</name>
                  <description>CPU started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUWAIT</name>
          <description>Enable for the CPU wait.</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable to the CPU wait.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CPU is not waiting.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>CPU is waiting.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="CPUCONF_NS">
      <name>CPUCONF_S</name>
      <description>CPU Configuration 1</description>
      <baseAddress>0x51011000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
