adamkondraciuk/nrfx/mdk/nrf54h20_engb_secure.svd
        <register>
          <name>RETAINCLR</name>
          <description>Clear RETAIN for individual GPIO pins</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <size>0x20</size>
          <fields>
            <field>
              <name>PIN0</name>
              <description>Clear RETAIN for pin 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN1</name>
              <description>Clear RETAIN for pin 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN2</name>
              <description>Clear RETAIN for pin 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN3</name>
              <description>Clear RETAIN for pin 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN4</name>
              <description>Clear RETAIN for pin 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN5</name>
              <description>Clear RETAIN for pin 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN6</name>
              <description>Clear RETAIN for pin 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN7</name>
              <description>Clear RETAIN for pin 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN8</name>
              <description>Clear RETAIN for pin 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN9</name>
              <description>Clear RETAIN for pin 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN10</name>
              <description>Clear RETAIN for pin 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN11</name>
              <description>Clear RETAIN for pin 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN12</name>
              <description>Clear RETAIN for pin 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN13</name>
              <description>Clear RETAIN for pin 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN14</name>
              <description>Clear RETAIN for pin 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN15</name>
              <description>Clear RETAIN for pin 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN16</name>
              <description>Clear RETAIN for pin 16</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN17</name>
              <description>Clear RETAIN for pin 17</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN18</name>
              <description>Clear RETAIN for pin 18</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN19</name>
              <description>Clear RETAIN for pin 19</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN20</name>
              <description>Clear RETAIN for pin 20</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write: writing a '1' sets pin to not retain; writing a '0' has no effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN21</name>
              <description>Clear RETAIN for pin 21</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Unretained</name>
                  <description>Read: pin not retained</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Retained</name>
                  <description>Read: pin retained</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
